КАКерамика_моя_старая_база/src/DataProcessors/КонтурЛогистика_ФоновыеИРегламентныеЗадания/КонтурЛогистика_ФоновыеИРегламентныеЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурЛогистика_ФоновыеИРегламентныеЗадания</name>
  <attributes>
    <name>МинутНазадФоновые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТолькоФоновыеКонтурЛогистика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТолькоАварии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РегламентныеЗаданияПодсистемы</name>
    <attributes>
      <name>ИмяМетаданных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Расписание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнялось</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФоновыеЗаданияПодсистемы</name>
    <attributes>
      <name>РегламентноеЗадание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМетода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Начало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Окончание</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сообщения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапущеноРегламентным</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьСекунд</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

КАКерамика_моя_старая_база/src/DataProcessors/КонтурЛогистика_ФоновыеИРегламентныеЗадания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СостояниеЗаданий() Экспорт
	
	Перем Обработка;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("РегламентныеАктивно");
	Результат.Вставить("РегламентныеВсего");
	Результат.Вставить("ФоновыеВыполняется");
	Результат.Вставить("ФоновыеАварийЗаЧас");
	
	Обработка = Создать();
	// условия формирования	
	Обработка.ОтображатьТолькоФоновыеКонтурЛогистика = Истина;
	Обработка.МинутНазадФоновые = ПоказыватьФоновыеПоУмолчаниюМинутНазад();	
	
	Обработка.ПерезаполнитьРегламентныеЗадания();
	Результат.Вставить("РегламентныеВсего", Обработка.РегламентныеЗаданияПодсистемы.Количество());
	Результат.Вставить("РегламентныеАктивно", Обработка.РегламентныеЗаданияПодсистемы.НайтиСтроки(
		Новый Структура("Использование", Истина)).Количество());
		
		Если  КонтурЛогистика_ДлительныеОперацииСервер.МенеджерФоновыхЗаданийДоступен() Тогда
			Обработка.ПерезаполнитьФоновыеЗадания();
			Результат.Вставить("ФоновыеВыполняется", Обработка.ФоновыеЗаданияПодсистемы.НайтиСтроки(
															Новый Структура("Состояние", "Задание выполняется")).Количество());
			Результат.Вставить("ФоновыеАварийЗаЧас", Обработка.ФоновыеЗаданияПодсистемы.НайтиСтроки(
															Новый Структура("Состояние", "Задание завершено с ошибками")).Количество());
		Иначе
			Результат.Вставить("ФоновыеВыполняется", 0);
			Результат.Вставить("ФоновыеАварийЗаЧас", 0);
		КонецЕсли;
		
	Обработка = Неопределено;
	
	Возврат Результат
	
КонецФункции

// при выводе фоновых заданий за какое время их фильтровать
Функция ПоказыватьФоновыеПоУмолчаниюМинутНазад() Экспорт
	
	Возврат 15; // минут
	
КонецФункции

#КонецЕсли
